recept/src/Documents/Тендер/Тендер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Тендер</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТоргов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешенияПоТоргам</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТендера</name>
    <type>
      <types>EnumRef.СписокСтатусовТендера</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускДиректора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДопускаДиректором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеТендера</name>
    <type>
      <types>EnumRef.СостояниеУчастияВТендере</types>
    </type>
  </attributes>
  <attributes>
    <name>ТендерныйСпециалист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОзнакомленияТендернымСпециалистом</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

recept/src/Enums/СостояниеУчастияВТендере/СостояниеУчастияВТендере.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеУчастияВТендере</name>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/СписокСтатусовТендера/СписокСтатусовТендера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СписокСтатусовТендера</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>Участие</name>
  </enumValues>
  <enumValues>
    <name>ДоговорПодписан</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/Тендер/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы 
// Обработчик изменения элемента "Допуск директора". Устанавливает состояние тендера в "В работе" и статус в "Участие".
&НаКлиенте
Процедура ДопускДиректораПриИзменении(Элемент)
	Объект.ДопускДиректора = Истина;
	Объект.ДатаДопускаДиректором = РаботаСоСправочниками.ПолучитьТекущуюДатуСеанса();
	Объект.СостояниеТендера = ПредопределенноеЗначение("Перечисление.СостояниеУчастияВТендере.ВРаботе");
	Объект.СтатусТендера = ПредопределенноеЗначение("Перечисление.СписокСтатусовТендера.Участие");
КонецПроцедуры

// Обработчик изменения поля "Тендерный специалист". Устанавливает флаг и дату ознакомления.
&НаКлиенте
Процедура ТендерныйСпециалистПриИзменении(Элемент)
	Объект.ТендерныйСпециалист = Истина;
	Объект.ДатаОзнакомленияТендернымСпециалистом = РаботаСоСправочниками.ПолучитьТекущуюДатуСеанса();
КонецПроцедуры

// Обрабатывает изменение статуса тендера.
&НаКлиенте
Процедура СтатусТендераПриИзменении(Элемент) 
    Если НЕ ЗначениеЗаполнено(Объект.СтатусТендера) Тогда
        Возврат;
    КонецЕсли;
	
	// Сохраняем статус "Заявка" в переменную для использования
    СтатусЗаявка = ПредопределенноеЗначение("Перечисление.СписокСтатусовТендера.Заявка");
	ЗакрытыйТендер = ПредопределенноеЗначение("Перечисление.СостояниеУчастияВТендере.Закрыт");
	
	// Проверка на статус "Отказ"
	Если Объект.СтатусТендера = ПредопределенноеЗначение("Перечисление.СписокСтатусовТендера.Отказ") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Примечание) Тогда
        	Сообщить("Напишите причину отказа в примечании");
        	Объект.СтатусТендера = СтатусЗаявка;
		Иначе 
			Объект.СостояниеТендера = ЗакрытыйТендер;
		КонецЕсли;
    ИначеЕсли НЕ Объект.ДопускДиректора Тогда
        Сообщить("Тендер не согласован");
        Объект.СтатусТендера = СтатусЗаявка;
    Иначе
        Объект.СостояниеТендера = ЗакрытыйТендер; 
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Обрабатывает событие при открытии формы документа "Тендер". 
// Устанавливает или проверяет статус тендера в зависимости от заполнения даты торгов.
//
// Параметры:
//   Отказ - Булево - Признак отказа от открытия формы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если Не ЗначениеЗаполнено(Объект.ДатаТоргов) Тогда
        УстановитьНачальныйСтатусТендера();
    Иначе
        ПроверитьСтатусТендераПоДате();
    КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСтатусовТендера 
// Устанавливает начальный статус тендера и его состояние.
&НаСервере
Процедура УстановитьНачальныйСтатусТендера()
    Объект.СтатусТендера = ПредопределенноеЗначение("Перечисление.СписокСтатусовТендера.Заявка");
    Объект.СостояниеТендера = ПредопределенноеЗначение("Перечисление.СостояниеУчастияВТендере.НаСогласовании");
КонецПроцедуры  

// Проверяет статус тендера на основе даты и обновляет примечание, статус и состояние тендера.
&НаСервере
Процедура ПроверитьСтатусТендераПоДате()
	Если НЕ Объект.ДопускДиректора Тогда 
		Если Объект.ДатаТоргов < ТекущаяДатаСеанса() Тогда
			Объект.Примечание = Объект.Примечание + "Дата тендера прошла. Участие не согласовано.";
			Объект.СтатусТендера = ПредопределенноеЗначение("Перечисление.СписокСтатусовТендера.Отказ");
			Объект.СостояниеТендера = ПредопределенноеЗначение("Перечисление.СостояниеУчастияВТендере.Закрыт");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрикрепитьДокумент(Команда)
	
	ПараметрыДиалогаПомещенияФайлов = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалогаПомещенияФайлов.Заголовок = "Выберите файл";
	ПараметрыДиалогаПомещенияФайлов.Фильтр = "Текстовый файл|*.txt|Все файлы|*.*";
	ПараметрыДиалогаПомещенияФайлов.МножественныйВыбор = Ложь;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершенииПомещенияФайла", ЭтотОбъект);
	ОповещениеОХодеВыполнения = Новый ОписаниеОповещения("ОповещениеОХодеПомещенияФайла", ЭтотОбъект);
	ОповещениеПередНачалом = Новый ОписаниеОповещения("ОповещениеПередНачаломПомещенияФайла", ЭтотОбъект); 
	НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении, ОповещениеОХодеВыполнения, ОповещениеПередНачалом, ,ПараметрыДиалогаПомещенияФайлов, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

 &НаКлиенте
Процедура ОповещениеОЗавершенииПомещенияФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт 
	Если ОписаниеПомещенногоФайла = Неопределено ИЛИ ОписаниеПомещенногоФайла.СсылкаНаФайл = Неопределено Тогда
		Сообщить("Файл не выбран.");
		Возврат;
	КонецЕсли;

	Сообщить("Файл загружен.");
	Сообщить("Адрес во временном хранилище: " + ОписаниеПомещенногоФайла.Адрес);
	Сообщить("Имя файла: " + ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя);
	Сообщить("Размер файла: " + ОписаниеПомещенногоФайла.СсылкаНаФайл.Размер());
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОХодеПомещенияФайла(ПомещаемыйФайл, Помещено, ОтказОтПомещения, ДополнительныеПараметры) Экспорт 
	Состояние("Файл " + ПомещаемыйФайл.Имя, Помещено, "Файл имеет размер " + ПомещаемыйФайл.Размер() + " байт.");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПередНачаломПомещенияФайла(ПомещаемыйФайл, Отказ, ДополнительныеПараметры) Экспорт 
	Сообщить("Помещаемый файл - " + ПомещаемыйФайл.Имя + ", размер = " + ПомещаемыйФайл.Размер());
КонецПроцедуры


#КонецОбласти
